---
kind: method
id: M:Autodesk.Revit.DB.FailuresAccessor.Dispose
source: html/8c30f9da-21a3-42ee-cd04-97f86b42bb71.htm
---
# Autodesk.Revit.DB.FailuresAccessor.Dispose Method

Releases all resources used by the FailuresAccessor

## Syntax (C#)
```csharp
public void Dispose()
```